## Plan result
[Build details](https://github.com/yuya-takeyama/terraform-modules/actions/runs/1084922573)
<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository.readonly-poly-repo[&#34;bar&#34;]
  * github_repository.readonly-poly-repo[&#34;foo&#34;]
<details>
<summary>Command output</summary>


```
[command]/home/runner/work/_temp/8f678b1b-04e6-487a-99a7-99c4af8aa6bc/terraform-bin plan -input=false

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.readonly-poly-repo["bar"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-bar"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository.readonly-poly-repo["foo"] will be created
  + resource "github_repository" "readonly-poly-repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "This repository is read only"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-module-foo"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_repository.readonly-poly-repo["bar"] will be created%0A  + resource "github_repository" "readonly-poly-repo" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = false%0A      + description            = "This repository is read only"%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = false%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "terraform-module-bar"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository.readonly-poly-repo["foo"] will be created%0A  + resource "github_repository" "readonly-poly-repo" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = false%0A      + description            = "This repository is read only"%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = false%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "terraform-module-foo"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + visibility             = "public"%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_repository.readonly-poly-repo["bar"] will be created%0A  + resource "github_repository" "readonly-poly-repo" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = false%0A      + description            = "This repository is read only"%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = false%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "terraform-module-bar"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository.readonly-poly-repo["foo"] will be created%0A  + resource "github_repository" "readonly-poly-repo" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = false%0A      + description            = "This repository is read only"%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = false%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://github.com/yuya-takeyama/terraform-modules"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "terraform-module-foo"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + visibility             = "public"%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::set-output name=stderr::
::set-output name=exitcode::0

```

</details>


<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":1,"Program":"tfcmt","SHA1":"5f5406185020a59657b30790a11c1a0ae51a1f14","Vars":{},"WorkflowName":"test"} -->